#include <iostream>
#include <iomanip>

/*
 * setw(10) - ширина вывода
 * setprecision(5) - количество знаков в мантиссе
*/

/*
 * F1(x) =  -3,01x^7 + 4324249x^2 + 2987456x
 *          (-3,01x^6 + 4324249x + 2987456)x
 *          ((-3,01x^5 + 4324249)x + 2987456)x
 *
 * F2(x) = -21.98x^3 - 21.98x^2 - 21.98x
 *         (-21.98x^2 - 21.98x^1 - 21.98)x
 *         ((-21.98x - 21.98)x - 21.98)x
 *
 *
 * R(x) = F1(x) / F2(x)
 *
 * Деление на 0 не учитывать
 * Только именованные объекты и константы
 * Создавать дополнительные функции?
 *
 * план отчета:
 *
 *     Дано:
 *          полиномы
 *          что найти
 *
 *     Контрольный пример (только в версии 1): x = 1.5
 *
 *     Способ решения:
 *      1, 2 и 3 способы.
 *
 *     Контрольный пример (только в версии 2 и 3): x = 1.5
 *
 *     Интерфейс пользователя:
 *          Макет вывода 1 (MO1): Заставка. ФИО, Группа, Версия, Даты начала и конца
 *          MO2: Введите X:
 *          MI3: sddd.ddd
 *          MO4: На шаге i промежуточное значение = ...
 *          ...
 *          MO5: Решение: sddd.dddedd
 *
 *      Блок-схема:
 *          ...
 *
 *      Текст программы:
 *          ...
 *
 *
*/

namespace {
const char credits [] = "===========================================================\n"
                        "Практическая работа №1 по дисциплине \"Программирование\"\n"
                        "Автор: Иванов Григорий Денисович\n" "Группа: 4335 (подгруппа 1)\n"
                        "Версия: 1\n" "Период выполнения работы: 10.01.2025 - 12.01.2025\n"
                        "===========================================================";

const char description [] = "Описание:\n"
                            "В этой программе будет проведен расчет значения математического\n"
                            "выражения R(x) = F(x)/Q(x), где:\n"
                            " F(x) = -3.01x^7 + 4324249x^2 + 2987456x,\n"
                            " Q(x) = -21.98x^3 - 21.98x^2 - 21.98x\n"
                            "Замечание: значение X, введенное пользователем, должно находиться\n"
                            "в диапазоне [-1.7E40, 1.7E40], деление на 0 не обрабатывается";

void printFloat(double number)
{
    bool negative = number < 0;
    std::cout << (negative ? "-" : " ");
    std::cout << std::setw(30) << std::setprecision(15)
              << std::setfill('0') << std::setiosflags(std::ios::right | std::ios::fixed)
              << (negative ? -number : number);
}
}

int main(int argc, char ** argv)
{
    (void) argc;
    (void) argv;

    double tmp, x, res, x_pow5;
    double f7 = -3.01, f2 = 4324249, f1 = 2987456;
    double q3 = -21.98, q2 = -21.98, q1 = -21.98;

    std::cout << credits << std::endl;
    std::cout << description << std::endl << std::endl;

    std::cout << "Введите x:";
    std::cin >> x;

    tmp = x*x;
    tmp *= x;
    tmp *= x;
    tmp *= x;
    x_pow5 = tmp;

    std::cout << "Промежуточные вычисления:\nx^5=";
    printFloat(x_pow5);
    std::cout << std::endl;

    tmp = ((f7*x_pow5 + f2)*x + f1)*x;
    tmp /= ((q3*x + q2)*x + q1)*x;
    res = tmp;

    std::cout << "\nРезультат: R(x)=";
    printFloat(res);
    std::cout << "\nЗавершение программы" << std::endl;

    return 0;
}
